backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (status = 'Backlog')
---
    def index
        tasks = {
            backlog: Task.where("status = 'Backlog'"),
            inProgress: Task.where("status = 'In Progress'"),
            forReview: Task.where("status = 'For Review'"),
            done: Task.where("status = 'Done'")

INSERT INTO "tasks" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 4], ["created_at", "2021-06-23 15:56:39.894365"], ["updated_at", "2021-06-23 15:56:39.894365"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        task = Task.create(
            title: params[:taskObj][:title],
            description: params[:taskObj][:description],
            assignee: params[:taskObj][:assignee],
            reviewer: params[:taskObj][:reviewer],
            status: params[:taskObj][:status],
            user: User.find_by(:id => params[:taskObj][:user])
        )

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "Done"], ["updated_at", "2021-06-23 19:32:37.220688"], ["id", 1]]
---
        task = Task.find_by(:id => params[:id])
        task.update(:status => params[:status])